## **Data Loading, Storage**

In [1]:
import numpy as np
import pandas as pd
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

### **Reading and Writing Data in Text Format**

In [10]:
df = pd.read_csv('/content/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
pd.read_table('/content/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

header=None으로 해서 default 이름이 column 명이 됨

In [12]:
pd.read_csv('/content/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

names를 이용해서 column명을 지정할 수 있음

In [13]:
pd.read_csv('/content/ex2.csv', names=['a','b','c','d', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

미리 list로 지정한 변수를 column 이름으로 넣을 수도 있고, index_col을 이용해서 index전체의 이름을 정할 수도 있음

In [14]:
names = ['a', 'b', 'c', 'd', 'message']
pd.read_csv('/content/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [16]:
!cat /content/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [15]:
parsed = pd.read_csv('/content/csv_mindex.csv',
                     index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

txt 파일 list로 불러오기

In [17]:
list(open('/content/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

txt를 불러오는법:
 '\s+'를 써서 기본적인 read_table의 불러오기 방법을 사용

In [18]:
result = pd.read_table('/content/ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [19]:
!cat /content/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

0,2,3번째 row에 있는 데이터를 읽지 않음

In [20]:
pd.read_csv('/content/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [21]:
!cat /content/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [23]:
result = pd.read_csv('/content/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

null값 체크하는 isnull

In [24]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

missing value들의 처리 방법을 정하는 na_values

In [25]:
result = pd.read_csv('/content/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

dictionary 형태로 특정 값을 NA 처리하게 할 수도 있다

In [26]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
pd.read_csv('/content/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

#### **Reading Text Files in Pieces**

In [27]:
pd.options.display.max_rows = 10

In [28]:
result = pd.read_csv('/content/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [29]:
pd.read_csv('/content/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [30]:
chunker = pd.read_csv('/content/ex6.csv', chunksize=1000)
chunker

chunksize에 기반하여 파일의 일부분을 읽게 한다.
여기선 key column에 있는 값들을 세서 count하게 함

In [31]:
chunker = pd.read_csv('/content/ex6.csv', chunksize=1000)

tot = pd.Series([])
for piece in chunker:
  tot = tot.add(piece['key'].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  This is separate from the ipykernel package so we can avoid doing imports until

In [32]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

#### **Writing Data to Text Format**

In [33]:
data = pd.read_csv('/content/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

data를 csv로 내보냄, 이때 경로를 설정

In [34]:
data.to_csv('/content/out.csv')

해당 파일을 읽을 수 있다

In [36]:
!cat /content/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [37]:
import sys

| 라는 데이터 구분자를 활용

In [38]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

na_rep - missing value들의 표현방식을 지정

In [39]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

첫 줄과 index이름을 없이 출력

In [40]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

column의 이름이 정한대로, 정한만큼까지의 데이터만 뽑아냄

In [41]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

Series 타입도 csv로 바꿀수가 있다

In [42]:
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts.to_csv('/content/tseries.csv')

In [43]:
!cat /content/tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

#### **Working with Delimited Formats**

In [44]:
!cat /content/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [45]:
import csv

In [46]:
f = open('/content/ex7.csv')

reader = csv.reader(f)

해당 파일에 있는 line을 list 형태로 불러옴

In [47]:
for line in reader:
  print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [48]:
with open('/content/ex7.csv') as f:
  lines = list(csv.reader(f))

파일 안의 내용을 header와 values로 구분

In [49]:
header, values = lines[0], lines[1:]

특정 header 아래에 있는 값들을 dictionary 형태로 표현하게 함

In [50]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [52]:
class my_dialect(csv.Dialect):
  lineterminator = '\n'
  delimiter = ';'
  quotechar='"'
  quoting = csv.QUOTE_MINIMAL

In [53]:
reader = csv.reader(f, dialect=my_dialect)

TypeError: ignored

In [54]:
reader = csv.reader(f, delimiter='|')

TypeError: ignored

In [55]:
with open('mydata.csv', 'w') as f: 
  writer = csv.writer(f, dialect=my_dialect) 
  writer.writerow(('one', 'two', 'three')) 
  writer.writerow(('1', '2', '3')) 
  writer.writerow(('4', '5', '6')) 
  writer.writerow(('7', '8', '9'))

#### **JSON Data**

In [56]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

json data 불러오기

In [57]:
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

json.dumps : python object를 json으로 변환

In [58]:
asjson = json.dumps(result)

In [59]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [60]:
!cat /content/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [61]:
data = pd.read_json('/content/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

pandas를 json으로 바꿔서 출력

In [62]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

출력할때 방향을 열방향 기준으로 뽑게함

In [63]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

#### **XML and HTML: Web Scraping**

In [65]:
pip install lxml

Requirement already satisfied: lxml in /usr/local/lib/python3.6/dist-packages (4.2.6)

In [66]:
pip install beautifulsoup4 html5lib

Requirement already satisfied: beautifulsoup4 in /usr/local/lib/python3.6/dist-packages (4.6.3)
Requirement already satisfied: html5lib in /usr/local/lib/python3.6/dist-packages (1.0.1)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.6/dist-packages (from html5lib) (1.15.0)
Requirement already satisfied: webencodings in /usr/local/lib/python3.6/dist-packages (from html5lib) (0.5.1)

In [67]:
tables = pd.read_html('/content/fdic_failed_bank_list.html')
len(tables)

1

In [68]:
failures = tables[0]
failures.head()

                      Bank Name  ...       Updated Date
0                   Allied Bank  ...  November 17, 2016
1  The Woodbury Banking Company  ...  November 17, 2016
2        First CornerStone Bank  ...  September 6, 2016
3            Trust Company Bank  ...  September 6, 2016
4    North Milwaukee State Bank  ...      June 16, 2016

[5 rows x 7 columns]

In [69]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

##### **Parsing XML with lxml.objectify**

In [70]:
from lxml import objectify

path = '/content/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [71]:
data = []

skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
               'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [72]:
perf = pd.DataFrame(data)
perf.head()

            AGENCY_NAME  ... MONTHLY_ACTUAL
0  Metro-North Railroad  ...           96.9
1  Metro-North Railroad  ...             95
2  Metro-North Railroad  ...           96.9
3  Metro-North Railroad  ...           98.3
4  Metro-North Railroad  ...           95.8

[5 rows x 12 columns]

In [73]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [76]:
root

In [77]:
root.get('href')

'http://www.google.com'

In [78]:
root.text

'Google'

### **Binary Data Formats**

In [79]:
frame = pd.read_csv('/content/ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [80]:
frame.to_pickle('/content/frame_pickle')

In [81]:
pd.read_pickle('/content/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [82]:
!rm /content/frame_pickle

#### **Using HDF5 Format**

In [83]:
frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [84]:
store['obj1']

           a
0  -0.204708
1   0.478943
2  -0.519439
3  -0.555730
4   1.965781
..       ...
95  0.795253
96  0.118110
97 -0.748532
98  0.584970
99  0.152677

[100 rows x 1 columns]

HDFStore는 fixed와 table이라는 2개의 저장 스키마를 지원한다.
table의 속도가 일반적으로 느리지만, query operation을 사용할 수 있다는 장점이 있다

where를 사용해서 특정 인덱스의 값들만 출력

In [85]:
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  1.007189
11 -1.296221
12  0.274992
13  0.228913
14  1.352917
15  0.886429

In [86]:
store.close()

In [87]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [88]:
pd.read_hdf('mydata.h5', 'obj3',where=['index < 5'])

          a
0 -0.204708
1  0.478943
2 -0.519439
3 -0.555730
4  1.965781

#### **Reading Microsoft Excel FIles**

In [91]:
xlsx = pd.ExcelFile('/content/ex1.xlsx')

특정 sheet만 불러오기

In [92]:
pd.read_excel(xlsx, "Sheet1")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [93]:
frame = pd.read_excel('/content/ex1.xlsx', 'Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [94]:
writer = pd.ExcelWriter('/content/ex2.xlsx')
frame.to_excel(writer, 'Sheet1')
writer.save()

In [95]:
frame.to_excel('/content/ex2.xlsx')

In [96]:
!rm /content/ex2.xlsx

### **Interacting with Web APIs**

In [97]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [98]:
data = resp.json()
data[0]['title']

'ENH: Handle numpy-like arrays in assert_almost_equal'

In [99]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])
issues

    number  ... state
0    39790  ...  open
1    39789  ...  open
2    39788  ...  open
3    39787  ...  open
4    39786  ...  open
..     ...  ...   ...
25   39758  ...  open
26   39757  ...  open
27   39756  ...  open
28   39753  ...  open
29   39752  ...  open

[30 rows x 4 columns]

### **Interacting with Databases**

In [100]:
import sqlite3
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('mydata.sqlite')
con.execute(query)
con.commit()

In [101]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [102]:
con.executemany(stmt, data)

In [103]:
con.commit()

In [104]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [105]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [106]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [107]:
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [108]:
!rm mydata.sqlite